In [1]:
import pandas as pd

In [4]:
data = {
    "Nombre": ["Juan", "Ana", "Pedro", "Maria"],
    "Edad": [25, 18, 33, 28],
    "Ciudad": ["Madrid", "Barcelona", "Valencia", "Sevilla"]
}

df = pd.DataFrame(data)

In [5]:
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1    Ana    18  Barcelona
2  Pedro    33   Valencia
3  Maria    28    Sevilla

In [7]:
# Agregar una nueva columna
df["Salario"] = [30000, 25000, 40000, 35000]
df

  Nombre  Edad     Ciudad  Salario
0   Juan    25     Madrid    30000
1    Ana    18  Barcelona    25000
2  Pedro    33   Valencia    40000
3  Maria    28    Sevilla    35000

In [8]:
# Modificar el contenido de toda una columna
df["Salario"] = df["Salario"] * 1.15
df

  Nombre  Edad     Ciudad  Salario
0   Juan    25     Madrid  34500.0
1    Ana    18  Barcelona  28750.0
2  Pedro    33   Valencia  46000.0
3  Maria    28    Sevilla  40250.0

In [10]:
nombres = df["Nombre"]
nombres

0     Juan
1      Ana
2    Pedro
3    Maria
Name: Nombre, dtype: object

In [12]:
# Filtrado
filtro = df["Edad"] > 25
mayores_25 = df[filtro]
mayores_25

  Nombre  Edad    Ciudad  Salario
2  Pedro    33  Valencia  46000.0
3  Maria    28   Sevilla  40250.0

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
type(nombres)

pandas.core.series.Series

## Tareas

In [ ]:
data = {
    "Titulo" : ["El Quijote", "Cien años de soledad", "La odisea"],
    "Autor" : ["Miguel de Cervantes", "Gabriel García Márquez", "Homero"],
    "Año" : [1605, 1896, -800]
}

libros_df = pd.DataFrame(data)
libros_df

                 Titulo                   Autor   Año
0            El Quijote     Miguel de Cervantes  1605
1  Cien años de soledad  Gabriel García Márquez  1896
2             La odisea                  Homero  -800

In [17]:
# Datos proporcionados
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

df_filtrado = df[df['Edad'] >= 25]
df_filtrado

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
3   Sara    27     Bilbao

In [19]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)
df["Edad_en_10_años"] = df["Edad"] + 10
df["Ciudad"] = df["Ciudad"].str.upper()
df["Es_Mayor_de_25"] = df["Edad"] >= 25
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_Mayor_de_25
0     Ana    25     MADRID               35            True
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True